# Transparency Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
LineProperties..::..Transparency Property
LineProperties Class See Also
---
The current transparency level to be applied to the current color.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2016
# Syntax
C#
---
```text
public int Transparency { get; }
```

Visual Basic
---
```text
Public ReadOnly Property Transparency As Integer
	Get
```

Visual C++
---
```text
public:
property int Transparency {
	int get ();
}
```

# See Also
LineProperties Class
Autodesk.Revit.DB Namespace